### Preparando ambiente para teste

In [ ]:
pip install -r codes/requirements.txt

In [3]:
from codes.postgres import PostgresDB
from codes.bigquery import BigQueryConnector
import pandas as pd

bigquery_client = BigQueryConnector("teste-4i")

In [14]:
dim_tables = ["DimAccount", "DimDepartmentGroup", "DimScenario"]

for table in dim_tables:
    print(f"Insert {table} in database")
    df_table = pd.read_csv(f"land/{table}.csv", sep=";")
    bigquery_client.save_dataframe(df_table, table, "Trusted")

Insert DimAccount in database
Insert DimDepartmentGroup in database
Insert DimScenario in database

Como eu usei o BigQuery nesse teste, precisei renomear o campo "OrganizationName"
pois não é permitido colunas com espaço em seu nome

In [15]:
print("Insert DimOrganization in database")
df_table = pd.read_csv("land/DimOrganization.csv", sep=";")
df_table["OrganizationName"] = df_table["OrganizationName"].str.replace(" ","")
bigquery_client.save_dataframe(df_table, "DimOrganization", "Trusted")

Insert DimOrganization in database

In [16]:
fact_table = "FactFinance"
print("Insert factFinance in database")
fact_df = pd.read_csv(f"land/{fact_table}.csv", sep=";")
fact_df["Amount"] = fact_df["Amount"].str.replace("R\$","")
fact_df["Amount"] = fact_df["Amount"].str.replace(",","")
fact_df["Amount"] = fact_df["Amount"].astype(float)
bigquery_client.save_dataframe(fact_df, fact_table, "Trusted")

Insert factFinance in database

/tmp/ipykernel_2544/213729911.py:4: FutureWarning: The default value of regex will change from True to False in a future version.
  fact_df["Amount"] = fact_df["Amount"].str.replace("R\$","")

### Resposta 1

In [17]:
query_1 = '''
SELECT 
 do.OrganizationName
,ddg.DepartmentGroupName
,ROUND(SUM(ff.Amount),2) as Amount 
FROM Trusted.FactFinance as ff 
INNER JOIN Trusted.DimOrganization as do on do.OrganizationKey = ff.OrganizationKey
INNER JOIN Trusted.DimDepartmentGroup as ddg on ddg.DepartmentGroupKey = ff.DepartmentGroupKey 
GROUP BY
 do.OrganizationName
,ddg.DepartmentGroupName
ORDER BY
 do.OrganizationName
,Amount
'''
bigquery_client.run_query(query_1)

   OrganizationName                   DepartmentGroupName     Amount
0         Australia                   Sales and Marketing  263278.33
1  CanadianDivision                   Sales and Marketing   65972.22
2            France  Executive General and Administration       5.01
3            France                         Manufacturing      11.40
4            France                  Inventory Management      15.65
5            France                             Corporate      19.91
6           Germany  Executive General and Administration      19.91
7           Germany              Research and Development      58.21
8           Germany                             Corporate      58.96

### Resposta 2

In [18]:
query_2 = '''
SELECT 
 ds.ScenarioName
,IFNULL(SUM(ff.Amount),0) as Amount 
FROM Trusted.DimScenario as ds 
LEFT JOIN Trusted.FactFinance as ff  on ff.ScenarioKey = ds.ScenarioKey 
GROUP BY
 ds.ScenarioName
ORDER BY
 Amount desc
'''
bigquery_client.run_query(query_2)

  ScenarioName    Amount
0       Actual  329439.6
1       Budget       0.0
2     Forecast       0.0

### Resposta 3

In [19]:
query_3 = '''
SELECT 
 dap.AccountDescription as ParentAccountDescription
,dap.AccountKey as ParentAccountKey
,da.AccountDescription
,da.AccountKey
FROM Trusted.DimAccount as da 
INNER JOIN Trusted.DimAccount as dap  on dap.AccountKey = da.ParentAccountKey 
ORDER BY
ParentAccountKey
,AccountKey
'''
bigquery_client.run_query(query_3)

,ParentAccountDescription,ParentAccountKey,AccountDescription,AccountKey
0,Long Term Liabilities,36,Other Long Term Liabilities,40
1,Gross Margin,49,Net Sales,50
2,Net Sales,50,Gross Sales,51
3,Net Sales,50,Returns and Adjustments,53
4,Net Sales,50,Discounts,54
5,Statistical Accounts,95,Square Footage,99

### Resposta 4

In [20]:
query_4 = """
execute immediate (             
  SELECT '''
    SELECT * 
    FROM (
      SELECT 
      ddg.DepartmentGroupName
      ,do.OrganizationName
      ,SUM(ff.Amount) AS Amount
      FROM Trusted.FactFinance AS ff 
      INNER JOIN Trusted.DimDepartmentGroup as ddg on ddg.DepartmentGroupKey = ff.DepartmentGroupKey 
      INNER JOIN Trusted.DimOrganization as do on do.OrganizationKey = ff.OrganizationKey
      GROUP BY 
      ddg.DepartmentGroupName
      , do.OrganizationName
      
    )
    PIVOT(
      SUM(Amount) 
      FOR OrganizationName 
      IN ("''' ||  STRING_AGG(DISTINCT OrganizationName, '", "' ORDER BY OrganizationName)  || '''"))
  '''
      from ( 
        SELECT 
        ddg.DepartmentGroupName
        ,do.OrganizationName
        ,SUM(ff.Amount) AS Amount
        FROM Trusted.FactFinance AS ff 
        INNER JOIN Trusted.DimDepartmentGroup AS ddg ON ddg.DepartmentGroupKey = ff.DepartmentGroupKey 
        INNER JOIN Trusted.DimOrganization AS do ON do.OrganizationKey = ff.OrganizationKey
        GROUP BY 
        ddg.DepartmentGroupName
        , do.OrganizationName)  column_names 
      ) 

;


"""
bigquery_client.run_query(query_4)

,DepartmentGroupName,Australia,CanadianDivision,France,Germany
0,Corporate,NaN,NaN,19.91,58.96
1,Executive General and Administration,NaN,NaN,5.01,19.91
2,Inventory Management,NaN,NaN,15.65,NaN
3,Manufacturing,NaN,NaN,11.40,NaN
4,Research and Development,NaN,NaN,NaN,58.21
5,Sales and Marketing,263278.33,65972.22,NaN,NaN